Revit 2027 API
ExportLayerTable.ContainsKey Method
 Checks whether a layer key exists in the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ContainsKey(
	ExportLayerKey exportlayerKey
)
Public Function ContainsKey (
	exportlayerKey As ExportLayerKey
) As Boolean
public:
bool ContainsKey(
	ExportLayerKey^ exportlayerKey
)
member ContainsKey :
        exportlayerKey : ExportLayerKey -> bool
Parameters
exportlayerKey ExportLayerKey
 The export layer Key.
Return Value
Boolean
 True if the layer key exists in the table.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace